{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "W_constraint": null, "b_constraint": null, "nb_row": 3, "batch_input_shape": [null, 40, 40, 3], "input_dtype": "float32", "nb_col": 3, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "trainable": true, "name": "convolution2d_1", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 128, "W_constraint": null, "b_constraint": null, "nb_row": 3, "activation": "linear", "nb_col": 3, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "trainable": true, "name": "convolution2d_2", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "W_constraint": null, "input_dim": 8192, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_1", "output_dim": 256, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "W_constraint": null, "input_dim": 256, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_2", "output_dim": 128, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "W_constraint": null, "input_dim": 128, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_3", "output_dim": 1, "b_regularizer": null}}], "keras_version": "1.2.0"}